app/controllers/annotations_controller.rb

  def index
    @annotations = Annotation.all
---
SELECT * FROM `annotations`

  def show
    @annotation = Annotation.find(params[:id])
---
SELECT * FROM `annotations` WHERE (`annotations`.`id` = 1)

  def edit
    @annotation = Annotation.find(params[:id])
---
SELECT * FROM `annotations` WHERE (`annotations`.`id` = 98)

  def create
    @annotation = Annotation.new(params[:annotation])

    respond_to do |format|
      if @annotation.save
---
INSERT INTO `annotations` (`page_id`, `label_id`, `xpath`, `created_at`, `updated_at`) VALUES(1, 1, '/html/body/table[1]/tbody[1]/tr[1]/td[1]/ol[1]/li', '2010-07-07 16:41:38', '2010-07-07 16:41:38')

  def update
    @annotation = Annotation.find(params[:id])

    respond_to do |format|
      if @annotation.update_attributes(params[:annotation])
---
SELECT * FROM `annotations` WHERE (`annotations`.`id` = 98)
UPDATE `annotations` SET `xpath` = '/html/body/div[2]/div/div/div[1]/div[1]/div[1]/div[1]/div/div//a[1][not(.=//table[@id=\'TwoWeekCalendar-ab\']/tbody[1]/tr/td/a[1])]', `updated_at` = '2010-07-13 08:04:38' WHERE `id` = 98

  def destroy
    @annotation = Annotation.find(params[:id])
    @annotation.destroy
---
SELECT * FROM `annotations` WHERE (`annotations`.`id` = 11)
DELETE FROM `annotations` WHERE `id` = 11