app/controllers/bookmarklet_controller.rb

SELECT * FROM `pages` WHERE (`pages`.`id` = 0)
SELECT * FROM `pages` WHERE (`pages`.`url` = 'http://www.google.com') LIMIT 1
INSERT INTO `pages` (`title`, `url`, `created_at`, `updated_at`) VALUES('Google', 'http://www.google.coasdfm', '2010-07-05 14:29:12', '2010-07-05 14:29:12')
---
	def page
		if(params[:id])
			@page = Page.find(params[:id]);
		else
			@page = Page.find_by_url(params[:page][:url] );
		end
		if @page
			render :js => "#{params[:callback]}(#{@page.to_json(:include => [:annotations])});"
		else
			@page = Page.new(params[:page])
			if @page.save

INSERT INTO `annotations` (`page_id`, `label`, `xpath`, `created_at`, `updated_at`) VALUES(NULL, NULL, NULL, '2010-07-09 03:23:53', '2010-07-09 03:23:53')
---
	def annotate
		    @annotation = Annotation.new(params[:annotation])
		    script = "#{params[:callback]}(#{@annotation.to_json});";
    		respond_to do |format|
    			if @annotation.save