app/controllers/pages_controller.rb

SELECT * FROM `pages`
---
  def index
    @pages = Page.all

INSERT INTO `pages` (`title`, `url`, `created_at`, `updated_at`) VALUES('adfadf', 'adfadsf', '2010-07-07 18:16:15', '2010-07-07 18:16:15')
---
  def create
    @page = Page.new(params[:page])

    respond_to do |format|
      if @page.save